public class Constants {
    public static final String MSG_HELLO = """
                    Привет! Меня зовут Otus, я онлайн школа, занимающаяся онлайн образованием.
                """;

    public static final String MSG_HELLO_USER = """
                    Привет! Меня зовут Иван, я студент онлайн школы, OTUS.
                """;

    public static final String ABOUT_ME = """
                    Что ты можешь рассказать про меня?
                """;

    public static final String CONTEXT_OTUS = """
                   OTUS сегодня – это более 130 авторских курсов для IT-специалистов из разных направлений таких как программирование, тестирование, инфраструктура, информационная безопасность, управление и Data Science. И что важно, у нас есть программы для разных уровней подготовки от новичков до профессионалов, которые хотят освоить продвинутые навыки.
                   Наша миссия — делать обучение осмысленным, реализуя взаимосвязь между ожиданиями работодателей, компетенциями специалистов и возможностями преподавателей.
                   Что ты можешь рассказать про меня?
                """;

    public static final String ONLY_CONTEXT_OTUS = """
                   Онлайн школа Otus сегодня – это более 130 авторских курсов для IT-специалистов из разных направлений таких как программирование, тестирование, инфраструктура, информационная безопасность, управление и Data Science. И что важно, у нас есть программы для разных уровней подготовки от новичков до профессионалов, которые хотят освоить продвинутые навыки.
                   Наша миссия — делать обучение осмысленным, реализуя взаимосвязь между ожиданиями работодателей, компетенциями специалистов и возможностями преподавателей.
                """;

    public static final String ABOUT_OTUS = """
                    Что ты можешь рассказать про школу OTUS?
                """;
}
